"use strict";
var __createBinding = (this && this.__createBinding) || (Object.create ? (function(o, m, k, k2) {
    if (k2 === undefined) k2 = k;
    var desc = Object.getOwnPropertyDescriptor(m, k);
    if (!desc || ("get" in desc ? !m.__esModule : desc.writable || desc.configurable)) {
      desc = { enumerable: true, get: function() { return m[k]; } };
    }
    Object.defineProperty(o, k2, desc);
}) : (function(o, m, k, k2) {
    if (k2 === undefined) k2 = k;
    o[k2] = m[k];
}));
var __setModuleDefault = (this && this.__setModuleDefault) || (Object.create ? (function(o, v) {
    Object.defineProperty(o, "default", { enumerable: true, value: v });
}) : function(o, v) {
    o["default"] = v;
});
var __importStar = (this && this.__importStar) || function (mod) {
    if (mod && mod.__esModule) return mod;
    var result = {};
    if (mod != null) for (var k in mod) if (k !== "default" && Object.prototype.hasOwnProperty.call(mod, k)) __createBinding(result, mod, k);
    __setModuleDefault(result, mod);
    return result;
};
var __awaiter = (this && this.__awaiter) || function (thisArg, _arguments, P, generator) {
    function adopt(value) { return value instanceof P ? value : new P(function (resolve) { resolve(value); }); }
    return new (P || (P = Promise))(function (resolve, reject) {
        function fulfilled(value) { try { step(generator.next(value)); } catch (e) { reject(e); } }
        function rejected(value) { try { step(generator["throw"](value)); } catch (e) { reject(e); } }
        function step(result) { result.done ? resolve(result.value) : adopt(result.value).then(fulfilled, rejected); }
        step((generator = generator.apply(thisArg, _arguments || [])).next());
    });
};
var __importDefault = (this && this.__importDefault) || function (mod) {
    return (mod && mod.__esModule) ? mod : { "default": mod };
};
Object.defineProperty(exports, "__esModule", { value: true });
const express_1 = __importDefault(require("express"));
const dotenv_1 = __importDefault(require("dotenv"));
const bodyParser = __importStar(require("body-parser"));
const mongoose_1 = __importDefault(require("mongoose"));
const exam_1 = __importDefault(require("./routes/exam"));
const Question_1 = __importDefault(require("./Models/Question"));
const Option_1 = __importDefault(require("./Models/Option"));
const path = __importStar(require("path"));
dotenv_1.default.config({ path: __dirname + '/.env' });
const { MONGO_CONNECTION } = process.env;
const PORT = process.env.PORT || 5000;
console.log("MONGO_CONNECTION", MONGO_CONNECTION);
console.log("PORT", PORT);
if (!MONGO_CONNECTION)
    throw new Error("MONGO_CONNECTION not set");
mongoose_1.default.connect(MONGO_CONNECTION);
const db = mongoose_1.default.connection;
db.on('error', console.error.bind(console, 'connection error:'));
db.once('open', function () {
    return __awaiter(this, void 0, void 0, function* () {
        const question = yield Question_1.default.findOne();
        if (!question) {
            for (let i = 0; i < questions.length; i++) {
                const q = questions[i];
                const options = [];
                for (let j = 0; j < q.answers.length; j++) {
                    const answer = q.answers[j];
                    const option_id = (yield new Option_1.default({ text: answer.name, is_correct: answer.status }).save())._id;
                    options.push(option_id);
                }
                yield Question_1.default.insertMany([{
                        text: q.question,
                        options: options
                    }]);
            }
        }
        console.log("mongoose connected");
    });
});
const app = (0, express_1.default)();
app.use(bodyParser.urlencoded({
    extended: true
}));
app.use(bodyParser.json());
app.use(express_1.default.json());
app.use(express_1.default.urlencoded());
app.use("/api/exam", exam_1.default);
app.listen(PORT, () => {
    console.log(`⚡️[server]: Server is running at http://localhost:${PORT}`);
});
app.use(express_1.default.static(path.join(__dirname, '../client/build')));
app.get('*', (req, res) => res.sendFile(path.resolve('client', 'build', 'index.html')));
const questions = [
    {
        "question": "Ո՞ր իրավական ակտով է կարգավորվում զենքի հետ կապված   հարաբերությունները Հայաuտանի Հանրապետությունում․",
        "answers": [
            { name: "«Զենքի շրջանառության կարգավորման մասին» ՀՀ օրենքով", status: true },
            { name: "ՀՀ Քրեական օրենսգրքով", status: false },
            { name: "ՀՀ Քրեական դատավարության օրենսգրքով", status: false },
            { name: "«Զենքի մասին» ՀՀ օրենքով", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում կենդանի կամ այլ նշանակետ խոցելու և վնասազերծելու համար նախատեսված սարքը կամ առարկան",
        "answers": [
            { name: "զենք", status: true },
            { name: "էլեկտրահարող սարք", status: false },
            { name: "փամփուշտ", status: false },
            { name: "վառոդ", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում մարդու մկանային ուժի օգնությամբ անմիջական շփման դեպքում կենդանի կամ այլ նշանակետ խոցելու համար նախատեսված առարկան",
        "answers": [
            { name: "սառը զենք", status: true },
            { name: "հրազեն", status: false },
            { name: "օդաճնշիչ զենք", status: false },
            { name: "մալած զենք", status: false },
        ]
    },
    {
        "question": "Նշվածներից որը հրազենի հիմնական բաղկացուցիչ մաս չէ",
        "answers": [
            { name: "նշանոց ", status: true },
            { name: "փողատուփը", status: false },
            { name: "փակաղակը", status: false },
            { name: "Փողը", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում մարդու մկանային ուժի կամ մեխանիկական սարքի օգնությամբ նպատակաուղղված շարժում ստացող՝ նետման համար հարմարեցված առարկաների միջոցով հեռավորության վրա գտնվող կենդանի կամ այլ նշանակետ խոցելու համար նախատեսված սարքը.",
        "answers": [
            { name: "նետողական զենք ", status: true },
            { name: "սառը զենք", status: false },
            { name: "օդաճնշիչ զենք", status: false },
            { name: "մալած զենք", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում սեղմված օդի կամ գազային նյութի էներգիայի հաշվին շարժում ստացող՝ նետվող հարմարանքի միջոցով նշանակետ խոցելու համար նախատեսված սարքը.",
        "answers": [
            { name: "սառը զենք", status: false },
            { name: "նետողական զենք", status: false },
            { name: "օդաճնշիչ զենք", status: true },
            { name: "մալած զենք", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում նշանակետը խոցելու համար նախատեսված այն առարկաները, սարքերը և նետվող հարմարանքները, որոնք պարունակում են պայթուցիկ, նետողական, հրատեխնիկական, արտամղիչ լիցքեր, կամ դրանց համակցություն․",
        "answers": [
            { name: "ռազմամթերք", status: true },
            { name: "նետողական զենք", status: false },
            { name: "պայթեցման սարք", status: false },
            { name: "ազդանշանային զենք", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում զենքից կրակելու համար նախատեսված համասարքը, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոց (հրապատիճ), նետողական լիցք (վառոդ) և նետվող հարմարանք (գնդակ, կոտորակ և այլն). ",
        "answers": [
            { name: "ռազմամթերք", status: false },
            { name: "նետողական զենք", status: false },
            { name: "պայթեցման սարք", status: false },
            { name: "փամփուշտ", status: true },
        ]
    },
    {
        "question": "Նշվածներից ո՞րը զենքի պարագա չէ․",
        "answers": [
            { name: "զենքի նշանոց", status: false },
            { name: "ջերմատեսիլ սարք", status: false },
            { name: "զենքի փող", status: true },
            { name: "պահեստատուփ", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է զենք պահելը․",
        "answers": [
            { name: "զենքին տիրապետում՝ զենք պահելու և կրելու կամ զենք պահելու և օգտագործելու թույլտվություն ունեցող ֆիզիկական անձի բնակության, իսկ իրավաբանական անձի գտնվելու վայրում՝ զենքի հետ վարվելու անվտանգության կանոնների պահպանմամբ", status: true },
            { name: "պահելու համար նախատեսված տարածքից դուրս զենքի տեղաշարժն անձի վրա ամրացված, կախված, պայուսակում դրված կամ ձեռքում բռնած վիճակում, իսկ նետողական զենքի դեպքում՝ նետման համար նախատեսված և դրա վրա տեղադրված նետվող հարմարանքով", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս հրազենի տեղաշարժը լիցքաթափված վիճակում, առանձնացված պահեստատուփով, դրված պահպանակի վրա՝ ծածկաշապիկով կամ պատյանով կամ տեղափոխման համար նախատեսված գործարանային այլ տարայով, նետողական զենքի դեպքում՝ փաթեթավորված և անձի վրա չամրացված վիճակում, իսկ նետվող հարմարանքը պետք է լինի առանձնացված", status: false },
            { name: "զենքի արտադրություն, առևտուր, վաճառք, հարդարում, նորոգում, փոխանցում, ձեռքբերում, հավաքածուների կազմում և դրանց ցուցադրում, հաշվառում, պահպանում, կրում, տեղափոխում (փոխադրում), օգտագործում, նվիրատվություն, ժառանգում, ոչնչացում, ներկրում Հայաստանի Հանրապետության տարածք և արտահանում Հայաստանի Հանրապետությունից (այսուհետ համապատասխանաբար՝ ներկրում և արտահանում)", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է զենք կրելը․",
        "answers": [
            { name: "զենքին տիրապետում՝ զենք պահելու և կրելու կամ զենք պահելու և օգտագործելու թույլտվություն ունեցող ֆիզիկական անձի բնակության, իսկ իրավաբանական անձի գտնվելու վայրում՝ զենքի հետ վարվելու անվտանգության կանոնների պահպանմամբ", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս զենքի տեղաշարժն անձի վրա ամրացված, կախված, պայուսակում դրված կամ ձեռքում բռնած վիճակում, իսկ նետողական զենքի դեպքում՝ նետման համար նախատեսված և դրա վրա տեղադրված նետվող հարմարանքով", status: true },
            { name: "պահելու համար նախատեսված տարածքից դուրս հրազենի տեղաշարժը լիցքաթափված վիճակում, առանձնացված պահեստատուփով, դրված պահպանակի վրա՝ ծածկաշապիկով կամ պատյանով կամ տեղափոխման համար նախատեսված գործարանային այլ տարայով, նետողական զենքի դեպքում՝ փաթեթավորված և անձի վրա չամրացված վիճակում, իսկ նետվող հարմարանքը պետք է լինի առանձնացված", status: false },
            { name: "զենքի արտադրություն, առևտուր, վաճառք, հարդարում, նորոգում, փոխանցում, ձեռքբերում, հավաքածուների կազմում և դրանց ցուցադրում, հաշվառում, պահպանում, կրում, տեղափոխում (փոխադրում), օգտագործում, նվիրատվություն, ժառանգում, ոչնչացում, ներկրում Հայաստանի Հանրապետության տարածք և արտահանում Հայաստանի Հանրապետությունից (այսուհետ համապատասխանաբար՝ ներկրում և արտահանում)", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է զենք տեղափոխելը (փոխադրելը)․",
        "answers": [
            { name: "զենքին տիրապետում՝ զենք պահելու և կրելու կամ զենք պահելու և օգտագործելու թույլտվություն ունեցող ֆիզիկական անձի բնակության, իսկ իրավաբանական անձի գտնվելու վայրում՝ զենքի հետ վարվելու անվտանգության կանոնների պահպանմամբ", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս զենքի տեղաշարժն անձի վրա ամրացված, կախված, պայուսակում դրված կամ ձեռքում բռնած վիճակում, իսկ նետողական զենքի դեպքում՝ նետման համար նախատեսված և դրա վրա տեղադրված նետվող հարմարանքով", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս հրազենի տեղաշարժը լիցքաթափված վիճակում, առանձնացված պահեստատուփով, դրված պահպանակի վրա՝ ծածկաշապիկով կամ պատյանով կամ տեղափոխման համար նախատեսված գործարանային այլ տարայով, նետողական զենքի դեպքում՝ փաթեթավորված և անձի վրա չամրացված վիճակում, իսկ նետվող հարմարանքը պետք է լինի առանձնացված", status: true },
            { name: "զենքի արտադրություն, առևտուր, վաճառք, հարդարում, նորոգում, փոխանցում, ձեռքբերում, հավաքածուների կազմում և դրանց ցուցադրում, հաշվառում, պահպանում, կրում, տեղափոխում (փոխադրում), օգտագործում, նվիրատվություն, ժառանգում, ոչնչացում, ներկրում Հայաստանի Հանրապետության տարածք և արտահանում Հայաստանի Հանրապետությունից (այսուհետ համապատասխանաբար՝ ներկրում և արտահանում)", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է զենքի շրջանառությունը․",
        "answers": [
            { name: "զենքին տիրապետում՝ զենք պահելու և կրելու կամ զենք պահելու և օգտագործելու թույլտվություն ունեցող ֆիզիկական անձի բնակության, իսկ իրավաբանական անձի գտնվելու վայրում՝ զենքի հետ վարվելու անվտանգության կանոնների պահպանմամբ", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս զենքի տեղաշարժն անձի վրա ամրացված, կախված, պայուսակում դրված կամ ձեռքում բռնած վիճակում, իսկ նետողական զենքի դեպքում՝ նետման համար նախատեսված և դրա վրա տեղադրված նետվող հարմարանքով", status: false },
            { name: "պահելու համար նախատեսված տարածքից դուրս հրազենի տեղաշարժը լիցքաթափված վիճակում, առանձնացված պահեստատուփով, դրված պահպանակի վրա՝ ծածկաշապիկով կամ պատյանով կամ տեղափոխման համար նախատեսված գործարանային այլ տարայով, նետողական զենքի դեպքում՝ փաթեթավորված և անձի վրա չամրացված վիճակում, իսկ նետվող հարմարանքը պետք է լինի առանձնացված", status: false },
            { name: "զենքի արտադրություն, առևտուր, վաճառք, հարդարում, նորոգում, փոխանցում, ձեռքբերում, հավաքածուների կազմում և դրանց ցուցադրում, հաշվառում, պահպանում, կրում, տեղափոխում (փոխադրում), օգտագործում, նվիրատվություն, ժառանգում, ոչնչացում, ներկրում Հայաստանի Հանրապետության տարածք և արտահանում Հայաստանի Հանրապետությունից (այսուհետ համապատասխանաբար՝ ներկրում և արտահանում)", status: true },
        ]
    },
    {
        "question": "Ի՞նչ է զենքի նորոգումը․",
        "answers": [
            { name: "զենքի հիմնական մասերը փոխելու կամ վերանորոգելու միջոցով զենքն աշխատունակ դարձնելը, զենքի ոչ հիմնական մասերի կոնստրուկտիվ փոփոխությունը, որի դեպքում զենքի մարտավարատեխնիկական բնութագրերը չեն փոխվում", status: true },
            { name: "զենքի գեղարվեստական ձևավորում, որի դեպքում զենքի մարտավարատեխնիկական բնութագրերը չեն փոխվում․", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է զենքի հարդարումը․",
        "answers": [
            { name: "զենքի հիմնական մասերը փոխելու կամ վերանորոգելու միջոցով զենքն աշխատունակ դարձնելը, զենքի ոչ հիմնական մասերի կոնստրուկտիվ փոփոխությունը, որի դեպքում զենքի մարտավարատեխնիկական բնութագրերը չեն փոխվում", status: false },
            { name: "զենքի գեղարվեստական ձևավորում, որի դեպքում զենքի մարտավարատեխնիկական բնութագրերը չեն փոխվում", status: true },
        ]
    },
    {
        "question": "Ինչ է կոչվում տեխնիկական կանոնակարգի պահանջներին համապատասխան՝ արցունքաբեր կամ գրգռիչ նյութերով լիցքավորված փամփուշտներով ատրճանակի կամ ռևոլվերի նմանվող սարքը, դրանց փամփուշտները կամ փչող (ցրող) սարքը՝ նախատեսված կենդանի նշանակետին ժամանակավորապես վնասազերծելու համար.",
        "answers": [
            { name: "գազային զենք", status: true },
            { name: "հրազեն", status: false },
            { name: "օդաճնշիչ զենք", status: false },
            { name: "մալած զենք", status: false },
        ]
    },
    {
        "question": "Որ փամփուշտն է կոչվում գազային․",
        "answers": [
            { name: "գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը, խցանը և Կառավարության սահմանած՝ օգտագործման թույլատրված արցունքաբեր կամ գրգռիչ նյութը, որը նախատեսված չէ մարդուն մահ պատճառելու համար", status: true },
            { name: "հրազենից, գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը) և լուսաձայնային գործողության լիցքը, որը նախատեսված չէ կենդանի կամ այլ նշանակետ խոցելու համար", status: false },
            { name: "միայն ուսումնական նպատակների համար օգտագործվող համասարք՝ բաղկացած պարկուճից և բռնկվող լիցքից նետվող առարկայից, որը պատրաստված է բնօրինակի չափերին և կառուցվածքին համապատասխան, և որի պարկուճի մեջ բացակայում է նետողական լիցքը, կամ այն փոխարինված է նույն կշռով այլ՝ ոչ այրվող նյութով, իսկ բռնկվող միջոցը (հրապատիճը) վնասված (կրակված) է: Ուսումնական փամփուշտի պարկուճի վրա պետք է լինի տարբերակիչ գծատիպ օղակաձև սեղմվածք", status: false },
            { name: "հրազենից կամ ազդանշանային սարքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը և նետվող լիցքը՝ լուսային, ձայնային կամ ծխային ազդանշան տալու համար, որը նախատեսված չէ կենդանի կամ այլ նշանակետի խոցման համար", status: false },
        ]
    },
    {
        "question": "Որ փամփուշտն է կոչվում լուսաձայնային.",
        "answers": [
            { name: "գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը, խցանը և Կառավարության սահմանած՝ օգտագործման թույլատրված արցունքաբեր կամ գրգռիչ նյութը, որը նախատեսված չէ մարդուն մահ պատճառելու համար", status: false },
            { name: "հրազենից, գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը) և լուսաձայնային գործողության լիցքը, որը նախատեսված չէ կենդանի կամ այլ նշանակետ խոցելու համար", status: true },
            { name: "միայն ուսումնական նպատակների համար օգտագործվող համասարք՝ բաղկացած պարկուճից և բռնկվող լիցքից նետվող առարկայից, որը պատրաստված է բնօրինակի չափերին և կառուցվածքին համապատասխան, և որի պարկուճի մեջ բացակայում է նետողական լիցքը, կամ այն փոխարինված է նույն կշռով այլ՝ ոչ այրվող նյութով, իսկ բռնկվող միջոցը (հրապատիճը) վնասված (կրակված) է: Ուսումնական փամփուշտի պարկուճի վրա պետք է լինի տարբերակիչ գծատիպ օղակաձև սեղմվածք", status: false },
            { name: "հրազենից կամ ազդանշանային սարքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը և նետվող լիցքը՝ լուսային, ձայնային կամ ծխային ազդանշան տալու համար, որը նախատեսված չէ կենդանի կամ այլ նշանակետի խոցման համար", status: false },
        ]
    },
    {
        "question": "Որ փամփուշտն է կոչվում ուսումնական․",
        "answers": [
            { name: "գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը, խցանը և Կառավարության սահմանած՝ օգտագործման թույլատրված արցունքաբեր կամ գրգռիչ նյութը, որը նախատեսված չէ մարդուն մահ պատճառելու համար", status: false },
            { name: "հրազենից, գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը) և լուսաձայնային գործողության լիցքը, որը նախատեսված չէ կենդանի կամ այլ նշանակետ խոցելու համար", status: false },
            { name: "միայն ուսումնական նպատակների համար օգտագործվող համասարք՝ բաղկացած պարկուճից և բռնկվող լիցքից նետվող առարկայից, որը պատրաստված է բնօրինակի չափերին և կառուցվածքին համապատասխան, և որի պարկուճի մեջ բացակայում է նետողական լիցքը, կամ այն փոխարինված է նույն կշռով այլ՝ ոչ այրվող նյութով, իսկ բռնկվող միջոցը (հրապատիճը) վնասված (կրակված) է․", status: true },
            { name: "հրազենից կամ ազդանշանային սարքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը և նետվող լիցքը՝ լուսային, ձայնային կամ ծխային ազդանշան տալու համար, որը նախատեսված չէ կենդանի կամ այլ նշանակետի խոցման համար.", status: false },
        ]
    },
    {
        "question": "Որ փամփուշտն է կոչվում ազդանշնանային․",
        "answers": [
            { name: "գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը, խցանը և Կառավարության սահմանած՝ օգտագործման թույլատրված արցունքաբեր կամ գրգռիչ նյութը, որը նախատեսված չէ մարդուն մահ պատճառելու համար", status: false },
            { name: "հրազենից, գազային զենքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը) և լուսաձայնային գործողության լիցքը, որը նախատեսված չէ կենդանի կամ այլ նշանակետ խոցելու համար", status: false },
            { name: "միայն ուսումնական նպատակների համար օգտագործվող համասարք՝ բաղկացած պարկուճից և բռնկվող լիցքից նետվող առարկայից, որը պատրաստված է բնօրինակի չափերին և կառուցվածքին համապատասխան, և որի պարկուճի մեջ բացակայում է նետողական լիցքը, կամ այն փոխարինված է նույն կշռով այլ՝ ոչ այրվող նյութով, իսկ բռնկվող միջոցը (հրապատիճը) վնասված (կրակված) է", status: false },
            { name: "հրազենից կամ ազդանշանային սարքից կրակելու համար նախատեսված համասարք, որը պարկուճի միջոցով մեկ ամբողջության մեջ ներառում է բռնկվող միջոցը (հրապատիճը), նետողական լիցքը և նետվող լիցքը՝ լուսային, ձայնային կամ ծխային ազդանշան տալու համար, որը նախատեսված չէ կենդանի կամ այլ նշանակետի խոցման համար", status: true },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում տարբեր բաղադրամասերից բաղկացած պայթուցիկ խառնուրդը, որը կարող է այրվել ըստ իր շերտերի զուգահեռության՝ առանց արտաքին միջավայրից թթվածնի ներթափանցման և չի վերածվում պայթյունի, այլ առաջ է բերում կայուն գազագոյացություն, հնարավորություն է տալիս կանոնավորելու գազագոյացման արագությունը․",
        "answers": [
            { name: "փամփուշտ", status: false },
            { name: "զենք", status: false },
            { name: "վառոդ", status: true },
            { name: "պայթուցիկ սարք", status: false },
        ]
    },
    {
        "question": "Նշվածներից, ո՞ր տեսակի հրաձգարան գոյություն չունի․",
        "answers": [
            { name: "փակ", status: false },
            { name: "կիսափակ", status: false },
            { name: "բաց", status: false },
            { name: "պարզ", status: true },
        ]
    },
    {
        "question": "Զենքը, ըստ համապատասխան սուբյեկտների կողմից օգտագործման նպատակայնության, հիմնական չափանիշների և բնութագրող հատկանիշների, չի լինում․",
        "answers": [
            { name: "քաղաքացիական", status: false },
            { name: "ակոսափող", status: true },
            { name: "ծառայողական", status: false },
            { name: "մարտական", status: false },
        ]
    },
    {
        "question": "Կարո՞ղ է արդյոք քաղաքացիական զենքն ունենալ կրակահերթով կրակելու հնարավորություն․",
        "answers": [
            { name: "այո", status: false },
            { name: "ոչ", status: true },
        ]
    },
    {
        "question": "Նշվածներից ո՞րը քաղաքացիական զենքի տեսակ չէ․",
        "answers": [
            { name: "ողորկափող", status: false },
            { name: "ակոսափող", status: false },
            { name: "ինքնապաշտպանական", status: true },
            { name: "սառը", status: false },
        ]
    },
    {
        "question": "Կարո՞ղ է արդյոք ծառայողական զենքն ունենալ կրակահերթով կրակելու հնարավորություն․",
        "answers": [
            { name: "այո", status: false },
            { name: "ոչ", status: true },
        ]
    },
    {
        "question": "Ո՞ր տեսակի զենքն իրավունք ունի ունենալ կրակահերթով կրակելու հնարավորություն․",
        "answers": [
            { name: "քաղաքացիական", status: false },
            { name: "ծառայողական", status: false },
            { name: "մարտական", status: true },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է արդյոք զենք ուղարկել կամ առաքել փոստով կամ ուղեբեռով․",
        "answers": [
            { name: "այո", status: false },
            { name: "ոչ", status: true },
        ]
    },
    {
        "question": "Նշվածներից ո՞րն է թույլատրվում․",
        "answers": [
            { name: "հավաքների կամ հանրային միջոցառումների մասնակցելիս քաղաքացիների կողմից զենք կրելը կամ տեղափոխելը (փոխադրելը)", status: false },
            { name: "ինքնապաշտպանության նպատակով քաղաքացիների կողմից սառը զենք կրելը", status: false },
            { name: "շրջանառության մեջ մտցնել 350 մմ-ից պակաս երկարություն ունեցող փողով կամ փողային տուփով և փողով ակոսափող հրազեն", status: true },
            { name: "ակոսափող հրազենի փամփուշտներով կրակելու համար հարմարեցված ողորկափող հրազեն", status: false },
        ]
    },
    {
        "question": "Բնակավայրերում, բնակավայրերից, մայրուղիներից, միջպետական և միջհամայնքային նշանակության ճանապարհներից ի՞նչ հեռավորության վրա է թույլատրվում ակոսափող հրազեն օգտագործել․",
        "answers": [
            { name: "2000 մետր", status: false },
            { name: "3000 մետր", status: false },
            { name: "5000 մետր", status: true },
        ]
    },
    {
        "question": "Բնակավայրերում, բնակավայրերից, մայրուղիներից, միջպետական և միջհամայնքային նշանակության ճանապարհներից ի՞նչ հեռավորության վրա է թույլատրվում ողորկափող հրազեն օգտագործել․",
        "answers": [
            { name: "500 մետր", status: true },
            { name: "2000 մետր", status: false },
            { name: "3000 մետր", status: false },
            { name: "5000 մետր", status: false },
        ]
    },
    {
        "question": "Ո՞ր մարմինն է տալիս  Ֆիզիկական և իրավաբանական անձանց՝ քաղաքացիական և ծառայողական զենքի համապատասխան թույլտվությունները․",
        "answers": [
            { name: "ՀՀ ՆԳՆ  փրկարար ծառայություն․", status: false },
            { name: "ՀՀ Բարձր տեխնոլոգիական արդյունաբերության նախարարություն․", status: false },
            { name: "ՀՀ ՆԳՆ ոստիկանություն", status: true },
            { name: "ՀՀ պաշտպանության նախարարություն․", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում զենք ձեռք բերելու թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: true },
            { name: "1 տարի գործողության ժամկետով", status: false },
            { name: "10 տարի գործողության ժամկետով", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում գազային զենք պահելու և կրելու թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: false },
            { name: "1 տարի գործողության ժամկետով", status: false },
            { name: "անժամկետ", status: true },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում զենք (բացառությամբ սառը և գազային զենքերի) պահելու և կրելու թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: false },
            { name: "10 տարի գործողության ժամկետով", status: true },
            { name: "անժամկետ", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում զենքի հավաքածու կազմելու  թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: false },
            { name: "10 տարի գործողության ժամկետով", status: true },
            { name: "անժամկետ", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում զենքի հավաքածու ցուցադրելու  թույլտվությունը",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: true },
            { name: "10 տարի գործողության ժամկետով", status: false },
            { name: "անժամկետ", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում որպես պարգև ստացած զենքը պահելու և կրելու  թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: false },
            { name: "10 տարի գործողության ժամկետով", status: false },
            { name: "անժամկետ", status: true },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում զենք, հրազենի հիմնական բաղկացուցիչ մասեր, փամփուշտներ ներկրելու կամ արտահանելու թույլտվությունը․",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: true },
            { name: "10 տարի գործողության ժամկետով", status: false },
            { name: "անժամկետ", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձանց ի՞նչ ժամկետով է տրամադրվում որպես պարգև ստացած և կրակոց արձակելու համար ոչ պիտանի դարձրած (մալած) մարտական կամ ծառայողական զենքը ժառանգելու դեպքում պահելու թույլտվությունը",
        "answers": [
            { name: "3 ամիս գործողության ժամկետով գործողության ժամկետով", status: false },
            { name: "6 ամիս գործողության ժամկետով", status: false },
            { name: "10 տարի գործողության ժամկետով", status: false },
            { name: "անժամկետ", status: true },
        ]
    },
    {
        "question": "Զենքը ենթակա է առգրավման, վերցման, և ոչնչացման, եթե՝",
        "answers": [
            { name: "սույն օրենքով նախատեսված լիցենզիաների գործողությունը դադարեցվել է, թույլտվությունները ճանաչվել են ուժը կորցրած, կամ վերոնշյալ լիցենզիաները կամ թույլտվությունները բացակայում են", status: false },
            { name: "զենք տնoրինողների մոտ հայտնաբերվել են ինքնաշեն կամ ձևափոխված, ձգաբանական կամ տեխնիկական բնութագրերի խախտումներով զենք կամ փամփուշտներ", status: false },
            { name: "մահացել է քաղաքացիական կամ ծառայողական զենքի կամ որպես պարգև տրված զենքի սեփականատերը` մինչև ժառանգության կամ զենքը տնօրինելու հարցը լուծելը", status: false },
            { name: "նշված բոլոր տարբերակները ճիշտ են", status: true },
        ]
    },
    {
        "question": "Քանի՞ տարեկան լրացած քաղաքացուն է թույլատրվում ձեռք բերել քաղաքացիական համակցված կամ ակոսափող հրազեն․",
        "answers": [
            { name: "18", status: false },
            { name: "19", status: false },
            { name: "21", status: true },
            { name: "25", status: false },
        ]
    },
    {
        "question": "Քանի՞ տարեկան լրացած քաղաքացուն է թույլատրվում ձեռք բերել քաղաքացիական ողորկափող հրազեն․",
        "answers": [
            { name: "18", status: true },
            { name: "19", status: false },
            { name: "21", status: false },
            { name: "25", status: false },
        ]
    },
    {
        "question": "Հայաստանի Հանրապետության քաղաքացին քանի՞ միավոր գազային զենք ձեռք բերելու իրավունք ունի․",
        "answers": [
            { name: "5", status: false },
            { name: "10", status: false },
            { name: "15", status: false },
            { name: "առավելագույն քանակ նախատեսված չէ", status: true },
        ]
    },
    {
        "question": "Հայաստանի Հանրապետության քաղաքացին զենքի հավաքածու կազմելու համար քանի՞ միավոր զենք ձեռք բերելու իրավունք ունի",
        "answers": [
            { name: "5", status: false },
            { name: "10", status: false },
            { name: "15", status: false },
            { name: "առավելագույն քանակ նախատեսված չէ", status: true },
        ]
    },
    {
        "question": "Քաղաքացու ձեռք բերած զենքը ձեռքբերման օրվանից քանի՞ աշխատանքային օրվա ընթացքում է ենթակա հաշվառման Հայաստանի Հանրապետության ՆԳՆ ոստիկանությունում․",
        "answers": [
            { name: "5", status: true },
            { name: "7", status: false },
            { name: "10", status: false },
            { name: "20", status: false },
        ]
    },
    {
        "question": "Քաղաքացու ձեռք բերած զենքը ձեռքբերման օրվանից քանի՞ աշխատանքային օրվա ընթացքում է ենթակա հաշվառման Հայաստանի Հանրապետության ՆԳՆ ոստիկանությունում․",
        "answers": [
            { name: "5", status: true },
            { name: "7", status: false },
            { name: "10", status: false },
        ]
    },
    {
        "question": "Զենք ձեռք բերելու թույլտվություն չի տրվում՝",
        "answers": [
            { name: "դիտավորյալ հանցագործություն կատարելու համար դատապարտված անձանց, որոնց դատվածությունն oրենքով սահմանված կարգով վերացված կամ մարված չէ", status: false },
            { name: "հրազենի գործադրմամբ դիտավորյալ հանցագործություն կատարելու համար դատապարտված անձանց", status: false },
            { name: "ընտանիքի անդամների նկատմամբ բռնություն գործադրելու հիմքերով հաշվառման մեջ գտնվող անձանց", status: false },
            { name: "նշված բոլոր տարբերակները ճիշտ են", status: true },
        ]
    },
    {
        "question": "Արդյո՞ք գրանցման և հաշվառման ենթական են տեխնիկական կանոնակարգին համապատասխան՝ մինչև 7.5 ջոուլ փողային էներգիայով օդաճնշիչ սարքը (այդ թվում՝ ռևոլվերները), դրանց փամփուշտները, մեխանիկական փոշեցրիչները, աերոզոլային և այլ սարքեր, որոնք լիցքավորված են արցունքաբեր կամ գրգռիչ նյութերով, էլեկտրահարող սարքերը ու կայծային պարպիչները, ինչպես նաև կառուցվածքով զենքի նմանվող իրերը և զենքի պարագաները․",
        "answers": [
            { name: "այո", status: false },
            { name: "ոչ", status: true },
        ]
    },
    {
        "question": "Նշվածներից ո՞րն է ենթակա հաշվառման և գրանցման․",
        "answers": [
            { name: "մինչև 7.5 ջոուլ փողային էներգիայով օդաճնշիչ սարքը", status: false },
            { name: "գազային զենքը", status: true },
            { name: "մեխանիկական փոշեցրիչները, աերոզոլային և այլ սարքեր, որոնք լիցքավորված են արցունքաբեր կամ գրգռիչ նյութերով․", status: false },
            { name: "զենքի պարագաները", status: false },
        ]
    },
    {
        "question": "Տարեկան քանի՞ միավոր զենք ներկրելու իրավունք ունեն ֆիզիկական և իրավաբանական անձինք․",
        "answers": [
            { name: "1", status: false },
            { name: "3", status: true },
            { name: "5", status: false },
            { name: "10", status: false },
        ]
    },
    {
        "question": "Արդյո՞ք քաղաքացին իրավունք ունի հարդարելու անձնական զենքն առանց զենքի հարդարման լիցենզիա ունենալու․",
        "answers": [
            { name: "այո", status: true },
            { name: "ոչ", status: false },
        ]
    },
    {
        "question": "Ի՞նչ գործողություն պետք է անհապաղ կատարի քաղաքացին, երբ հայտնաբերում է զենք․",
        "answers": [
            { name: "թաքցնի ապահով և անվտանգ վայրում", status: false },
            { name: "հանձնի ՀՀ ՆԳՆ ոստիկանության մոտակա ստորաբաժանում", status: true },
            { name: "հանձնի զենքի առևտրի լիցենզիա ունեցող իրավաբական անձին", status: false },
            { name: "միջոցներ ձեռնարկի զենքի տիրոջը գտնելու", status: false },
        ]
    },
    {
        "question": "ֆիզիկական անձը ի՞նչ պայմաններում է պարտավոր պահել զենքը․",
        "answers": [
            { name: "ապահովվի զենքի պահպանությունը, անվտանգությունը, և բացառվի կողմնակի անձանց համար հասանելիությունը", status: true },
            { name: "ապահովվի զենքի պահպանությունը և անվտանգությունը և հասանելի լինի ընտանիքի մյուս անդամներին", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է որսորդությամբ զբաղվելու նպատակով քաղաքացիական զենք կրել որսահանդակից դուրս․",
        "answers": [
            { name: "թույլատրվում է", status: false },
            { name: "արգելվում է", status: true },
        ]
    },
    {
        "question": "Անհապաղ ի՞նչ գործողություն պետք է կատարի զենքի սեփականատերը  զենքի կորսվելու, հափշտակվելու դեպքերում․",
        "answers": [
            { name: "սոցիալական ցանցերում հայտարարություն տեղադրի", status: false },
            { name: "դիմի  ՀՀ ՆԳՆ ոստիկանություն", status: true },
            { name: "դիմի զենքի առևտրի լիցենզիա ունեցող իրավաբական անձին", status: false },
            { name: "ինքնակամ միջոցներ ձեռնարկի զենքը գտնելու", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է զենք պահելու և կրելու իրավունք ունեցող քաղաքացուն անձնական օգտագործման համար կատարել ողորկափող հրազենի փամփուշտների լիցքավորում, եթե տվյալ քաղաքացին չունի ողորկափող հրազեն․",
        "answers": [
            { name: "թույլատրվում է", status: false },
            { name: "արգելվում է", status: true },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է ողորկափող հրազեն պահելու և կրելու իրավունք ունեցող քաղաքացուն անձնական օգտագործման համար կատարել ողորկափող հրազենի փամփուշտների լիցքավորում․",
        "answers": [
            { name: "թույլատրվում է", status: true },
            { name: "արգելվում է", status: false },
        ]
    },
    {
        "question": "Նշվածներից որ սուբյեկտն իրավունք չունի կատարել քաղաքացիական ակոսափող հրազենի փամփուշտների լիցքավորում․",
        "answers": [
            { name: "քաղաքացիական և ծառայողական զենքի առևտրի լիցենզիա ունեցող իրավաբանական անձը", status: false },
            { name: "ֆիզիկական անձը", status: true },
            { name: "սպորտային հրաձգության կազմակերպությունները", status: false },
            { name: "քաղաքացիական և ծառայողական զենքի արտադրության լիցենզիա ունեցող իրավաբանական անձը", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է քաղաքացուն զենքի հավաքածուում ընդգրկված զենքը օգտագործել սիրողական և սպորտային հրաձգության ժամանակ․",
        "answers": [
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը գրավոր տեղեկացնելուց հետո", status: true },
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը բանավոր տեղեկացնելուց հետո", status: false },
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը բանավոր տեղեկացնելուց հետո", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է քաղաքացուն զենքի հավաքածուում ընդգրկված զենքը օգտագործել որսորդության ժամանակ․",
        "answers": [
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը գրավոր տեղեկացնելուց հետո", status: true },
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը բանավոր տեղեկացնելուց հետո", status: false },
            { name: "թույլատրվում է, նախապես ՀՀ ՆԳՆ ոստիկանությանը բանավոր տեղեկացնելուց հետո", status: false },
        ]
    },
    {
        "question": "Ֆիզիակական անձն իրավունք ունի՞ իրեն պատկանող զենքը տրամադրել զենքի հավաքու ցուցադրելու թույլտվություն ունեցող այլ ֆիզիկական անձանց՝ ցուցադրության նպատակով․",
        "answers": [
            { name: "թույլատրվում է, միայն  ՀՀ ՆԳՆ ոստիկանությանը գրավոր տեղեկացնելուց հետո", status: false },
            { name: "թույլատրվում է, նրանց հետ կնքած համապատասխան պայմանագրի հիման վրա", status: true },
        ]
    },
    {
        "question": "Հայաստանի Հանրապետությունում հրազենով պարգևատրելու իրավունք ունի միայն․․․",
        "answers": [
            { name: "ՀՀ նախագահը", status: false },
            { name: "ՀՀ Ազգային ժողովի նախագահը", status: false },
            { name: "ՀՀ վարչապետը", status: true },
            { name: "ՀՀ պաշտպանության նախարարը", status: false },
        ]
    },
    {
        "question": "Որպես պարգև տրված զենքի սեփականատերը կամ ժառանգը զենքը չի կարող հանձնել այլ անձի տիրապետմանը, օգտագործմանը կամ տնօրինմանը, բացառությամբ․․․",
        "answers": [
            { name: "քաղաքացիական և ծառայողական զենքի առևտրի լիցենզիա ունեցող իրավաբանական անձանց՝ նվիրելու նպատակով կամ պետական ռազմականացված կազմակերպություններին՝ վաճառելու նպատակով", status: false },
            { name: "քաղաքացիական և ծառայողական զենքի առևտրի լիցենզիա ունեցող իրավաբանական անձանց՝ վաճառելու նպատակով կամ պետական ռազմականացված կազմակերպություններին՝ նվիրելու նպատակով", status: true },
            { name: "քաղաքացիական և ծառայողական զենքի առևտրի լիցենզիա ունեցող իրավաբանական անձանց՝ և պետական ռազմականացված կազմակերպություններին՝ վաճառելու նպատակով", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է Ֆիզիկական անձին իր զենքը, հրազենի հիմնական բաղկացուցիչ մասերը և փամփուշտները վաճառելու կամ նվիրելու զենքի համապատասխան թույլտվություն ունեցող ֆիզիկական կամ իրավաբանական անձին՝ նախապես այդ մասին տեղեկացնելով Հայաստանի Հանրապետության ոստիկանությանը․",
        "answers": [
            { name: "թույլատրվում է", status: true },
            { name: "արգելվում է", status: false },
        ]
    },
    {
        "question": "ՀՀ քաղաքացիներն օրինական հիմքով իրենց մոտ գտնվող զենքը ո՞ր դեպքում կարող են գործադրել․",
        "answers": [
            { name: "միայն անհրաժեշտ պաշտպանության կամ ծայրահեղ անհրաժեշտության դեպքում", status: true },
            { name: "իրենց օրինական պահանջը չկատարելու դեպքում", status: false },
            { name: "քաղաքացու իրավունքները ոտնահարելու դեպքում", status: false },
        ]
    },
    {
        "question": "Զենք գործադրելուց առաջ ի՞նչ պետք է հայտարարեք այն անձին ում նկատմամբ պատրաստվում եք զենք գործադրել, բացառությամբ այն դեպքերի, երբ գործադրման ձգձգումը կարող է անմիջական վտանգի տակ դնել մարդկանց կյանքը կամ առաջացնել այլ ծանր հետևանքներ:",
        "answers": [
            { name: "պարզորոշ նախազգուշացնել", status: true },
            { name: "գրավոր նախազգուշացնել", status: false },
            { name: "հայտարարել իրավունքները", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է հրազեն գործադրել մեկից ավելի կանանց, հաշմանդամության ակնհայտ նշաններ ունեցող անձանց և անչափահասների  զինված հարձակման դեպքում․",
        "answers": [
            { name: "թույլատրվում է", status: true },
            { name: "արգելվում է", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է հրազեն գործադրել մարդկանց զգալի կուտակումների ժամանակ․",
        "answers": [
            { name: "թույլատրվում է", status: false },
            { name: "արգելվում է", status: true },
        ]
    },
    {
        "question": "Ի՞նչ ժամկետում է պարտավոր զենք գործադրողը զենքի գործադրման մասին հայտնել ՀՀ ՆԳՆ ոստիկանությանը․",
        "answers": [
            { name: "անհապաղ, բայց ոչ ուշ, քան 24 ժամվա ընթացքում", status: true },
            { name: "անհապաղ, բայց ոչ ուշ, քան 12 ժամվա ընթացքում", status: false },
            { name: "դեպքի վայրի պատշաճ պահպանումն ապահովելուց հետո", status: false },
        ]
    },
    {
        "question": "Ո՞ր օրենսգրքով են սահմանված «անհրաժեշտ պաշտպանությունը» և «ծայրահեղ անհրաժեշտությունը»․",
        "answers": [
            { name: "ՀՀ Քրեական օրենսգրքով", status: true },
            { name: "ՀՀ վարչական իրավախախտումների մասին օրենսգրքով", status: false },
            { name: "ՀՀ Քրեական դատավարության օրենսգրքով", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում այն գործողությունը, որը կատարվում է պաշտպանվողի կամ այլ անձի կյանքը, առողջությունը, իրավունքները, ազատությունները, օրինական շահերը, հասարակության կամ պետության օրինական շահերը սույն օրենսգրքով նախատեսված հակաիրավական ոտնձգությունից կամ դրա իրական սպառնալիքից ոտնձգություն կատարողին վնաս պատճառելու միջոցով պաշտպանելիս․",
        "answers": [
            { name: "Անհրաժեշտ պաշտպանություն", status: true },
            { name: "Ծայրահեղ անհրաժեշտություն", status: false },
            { name: "Հրաման կամ կարգադրություն կատարել", status: false },
        ]
    },
    {
        "question": "Ի՞նչ է կոչվում քրեական օրենքով պաշտպանվող շահերին վնաս պատճառելը, որն ուղղված է եղել տվյալ անձի կամ այլ անձանց կյանքին, առողջությանը, իրավունքներին, ազատություններին կամ օրինական շահերին, հասարակության կամ պետության օրինական շահերին անմիջականորեն սպառնացող վտանգը վերացնելու համար, եթե տվյալ իրադրությունում այդ վտանգը չէր կարելի վերացնել այլ միջոցներով․",
        "answers": [
            { name: "Ծայրահեղ անհրաժեշտություն", status: true },
            { name: "Անհրաժեշտ պաշտպանություն", status: false },
            { name: "Հրաման կամ կարգադրություն կատարել", status: false },
        ]
    },
    {
        "question": "«Անհրաժեշտ պաշտպանությունը» ՀՀ Քրեական օրենսգրքի ո՞ր հոդվածով է սահմանված․",
        "answers": [
            { name: "32-րդ հոդված", status: true },
            { name: "44-րդ հոդված", status: false },
            { name: "46-րդ հոդված", status: false },
        ]
    },
    {
        "question": "«Ծայրահեղ անհրաժեշտությունը» ՀՀ Քրեական օրենսգրքի ո՞ր հոդվածով է սահմանված․",
        "answers": [
            { name: "34-րդ հոդված", status: true },
            { name: "46-րդ հոդված", status: false },
            { name: "42-րդ հոդված", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձը ե՞րբ պետք է իրեն պատկանող ակոսափող հրազենն ստուգման նպատակով կրակելու համար ներկայացնի փորձաքրեագիտական ստորաբաժանում` Հայաստանի Հանրապետության ՆԳՆ ոստիկանության տված ուղեգրի համաձայն․",
        "answers": [
            { name: "զենք պահելու և կրելու թույլտվության ժամկետը երկարաձգելու համար", status: false },
            { name: "զենք պահելու և օգտագործելու թույլտվության ժամկետը երկարաձգելու համար", status: true },
            { name: "տարին մեկ անգամ", status: false },
            { name: "5 տարին մեկ անգամ", status: false },
        ]
    },
    {
        "question": "Ֆիզիկական անձը ե՞րբ պետք է իրեն պատկանող ակոսափող հրազենն ստուգման նպատակով կրակելու համար ներկայացնի փորձաքրեագիտական ստորաբաժանում` Հայաստանի Հանրապետության ՆԳՆ ոստիկանության տված ուղեգրի համաձայն․",
        "answers": [
            { name: "Ակոսափող զենքը վաճառելու, նվիրելու, ժառանգելու դեպքում", status: false },
            { name: "զենք  պահելու և օգտագործելու թույլտվության ժամկետը երկարաձգելու համար", status: true },
            { name: "տարին մեկ անգամ", status: false },
            { name: "5 տարին մեկ անգամ", status: false },
        ]
    },
    {
        "question": "Քաղաքացին քանի՞ օրից ավել Հայաստանի Հանրապետությունից բացակայելու դեպքում է զենքն ի պահ հանձնում Հայաստանի Հանրապետության ոստիկանության տարածքային ստորաբաժանմանը․",
        "answers": [
            { name: "30 օր", status: false },
            { name: "60 օր", status: false },
            { name: "180 օր", status: true },
            { name: "մեկ տարի", status: false },
        ]
    },
    {
        "question": "Քանի՞ տարեկան լրացած անձին է թույլատրվում հրաձգարանում տրամադրել զենք և փամփուշտ՝ անձը հաստատող փաստաթուղթ ներկայացվելու դեպքում․",
        "answers": [
            { name: "13", status: false },
            { name: "16", status: true },
            { name: "18", status: false },
            { name: "21", status: false },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է հրաձգարանին պատկանող զենքը և ռազմամթերքը դուրս հանել հրաձգարանի տարածքից․",
        "answers": [
            { name: "թույլատրվում է", status: false },
            { name: "արգելվում է", status: true },
        ]
    },
    {
        "question": "Անհրաժե՞շտ է արդյոք ֆիզիկական անձի կողմից ձեռքբերված զենքը գրանցել ՀՀ ՆԳՆ ոստիկանությունում․",
        "answers": [
            { name: "անհրաժեշտ է միայն այն դեպքում, երբ նախորդ սեփականատերը դրան տիրում էր ապօրինի ճանապարհով․", status: false },
            { name: "գրանցել անհրաժեշտ է միայն չգրանցված (մինչ այդ չգրանցված) զենքը․", status: false },
            { name: "Ցանկացած դեպքում անհրաժեշտ է:", status: true },
        ]
    },
    {
        "question": "Թույլատրվու՞մ է ֆիզիկական անձի կողմից չգրանցված զենքի տնօրինում․",
        "answers": [
            { name: "չի թույլատրվում ", status: true },
            { name: "թույլ է տրվում ցանկացած դեպքում", status: false },
            { name: "թույլ է տրվում, բացառությամբ այն դեպքի, երբ տվյալ զենքը անձի սեփականություն է դարձել հանցավոր ճանապարհով", status: false },
        ]
    },
];
